In [1]:
import pandas as pd
import numpy as np
import tensorflow as tf
from tensorflow import keras
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv("bank_churn.csv")
df.sample(5)

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
9972,15747927,758,France,Male,26,4,155739.76,1,1,0,171552.02,0
6114,15662488,627,France,Female,44,5,0.00,2,1,0,82969.61,1
4217,15583840,587,Germany,Male,35,5,121863.61,1,1,1,23481.69,1
4927,15803456,641,France,Female,40,9,0.00,1,0,0,151648.66,1
6691,15651389,561,Spain,Male,24,8,143656.55,1,0,1,180932.46,0

In [4]:
df.groupby(by=['churn'])['customer_id'].count() #imbalanced dataset

churn
0    7963
1    2037
Name: customer_id, dtype: int64